{
    "scripts":
    [
        [
            [
                "How may I help you?", 
                "You may request help with:"
            ],
            [
                "Choosing a bank savings account", 
                "Choosing a home loan plan", 
                "Choosing a life insurance policy"
            ]
        ]
    ],
    "bank-savings":
    [
        [
            [
                "To find a bank account that is best suited for you, I need to ask you several questions.",
                "First, how old are you?"
            ],
            ["<input type='number' name='age' min='0' placeholder='Enter number'><input type='submit' value='ok'>"]
        ],
        [
            ["What is your occupation?"],
            ["<input type='text' name='occupation' pattern='[A-Za-z]'><input type='submit' value='ok'>"]
        ],
        [
            ["What is your monthly income/allowance (SGD)?"],
            ["<input type='number' name='income' min='0' placeholder='Enter number'><input type='submit' value='ok'>"]
        ],
        [
            ["What is your estimated net worth (SGD)?"],
            ["<input type='number' name='net-worth' min='0' placeholder='Enter number'><input type='submit' value='ok'>"]
        ],
        [
            ["What is your estimated monthly expenditure (SGD)?"],
            ["<input type='number' name='expenditure' min='0' placeholder='Enter number'><input type='submit' value='ok'>"]
        ],
        [
            [
                "Based on your information, this is my recommendation: Super Savers Account",
                "The Super Savers Account helps you earn interest rates in the first S$100,000 balance in your account. There is no service fee, no minimum salary credit or credit card spend required. If your transactions with your Super Savers Account each month is below S$3,000, you get 0.05% interest p.a. If your transactions with your Super Savers Account each month is between S$3,000 and S$10,000, you get 1.50% interest p.a. If your transactions with your Super Savers Account each month is S$10,000 or more, you get 3.50% interest p.a.",
                "This is the end of the task. Please click “Next” to answer several questions about your experience while finding an appropriate bank account."
            ],
            ["Next"]
        ],
        [
            ["Please enter verification code"],
            ["<input type='number' name='verification111' min='0' placeholder='Enter verification code'><input type='submit' value='ok'>"]            
        ]
    ],
    "life-insurance":
    [
        [
            [
                "To find out the best life insurance plan for you, I would like to ask you several questions.",
                "First, what is your age?"
            ],
            ["<input type='number' name='expenditure' min='0' placeholder='Enter number'><input type='submit' value='ok'>"]
        ],
        [
            ["Do you smoke?"],
            ["Yes", "No"]
        ],
        [
            ["Do you have any existing medical conditions?"],
            ["Yes", "No"]
        ],
        [
            ["Does your family have a history of cancer, cardiovascular conditions, or stroke?"],
            ["Yes", "No"]
        ],
        [
            [
                "Based on your information, this is my recommendation: ProtectForLife insurance plan",
                "With the ProtectForLife insurance plan, you only need to pay premiums for 15 years for a lifetime of protection. You will receive financial protection in the event of death, total and permanent disability or terminal illness. The coverage increases progressively, with non-guaranteed bonuses added to the basic sum assured. You also have the option to include riders to receive coverage for critical illness and cash payouts.",
                "This is the end of the task. Please click “Next” to answer several questions about your experience while finding an appropriate life insurance policy."
            ],
            ["Next"]
        ],
        [
            ["Please enter verification code"],
            ["<input type='number' name='verification222' min='0' placeholder='Enter verification code'><input type='submit' value='ok'>"]            
        ]
    ],
    "home-loan":
    [
        [
            [
                "To find a home loan plan that is best suited for you, I need to ask you several questions.",
                "First, what kind of property are you looking for?"
            ],
            ["Landed", "Condo", "Exec Condo", "HDB"]
        ],
        [
            ["How many rooms are you looking for?"],
            ["More than 5", "5", "4", "3", "2"]
        ],
        [
            ["How many properties do you own in Singapore?"],
            ["<input type='number' name='expenditure' min='0' placeholder='Enter number'><input type='submit' value='ok'>"]
        ],
        [
            ["What is the combined monthly income of the owners of this new property that you are thinking of buying?"],
            ["<input type='number' name='expenditure' min='0' placeholder='Enter number'><input type='submit' value='ok'>"]
        ],
        [
            [
                "Based on your information, this is my recommendation: 25-year loan plan",
                "With this loan, you pay monthly instalments with a 1.70% interest rate." ,
                "The monthly instalment comprises the principal repayment and interest payment. You may use cash or CPF to pay your monthly instalments. Interest is charged daily, based on the principal loan amount that is outstanding.",
                "This is the end of the task. Please click “Next” to answer several questions about your experience while finding an appropriate home loan plan."
            ],
            ["Next"]
        ],
        [
            ["Please enter verification code"],
            ["<input type='number' name='verification333' min='0' placeholder='Enter verification code'><input type='submit' value='ok'>"]            
        ]
    ]

}
